{
  "Header": {
    "title": "Jeb Bradwell's Portfolio",
    "paragraph": "Welcome to my portfolio. Checkout my projects."
  },
  "About": {
    "paragraph": "Hi, I’m Jeb — a software engineer and solo game developer. I specialize in building high-performance web systems and immersive games, blending real-time multiplayer networking with thoughtful, scalable design. I’m currently working on a web-based MMO Action RPG, leveraging Node.js, TypeScript, Phaser 3, Redis, MariaDB, Socket.io, and µWebSockets to create fast, responsive gameplay across platforms. I also write about development workflows and problem-solving on Medium, sharing insights from my experiences building games and software from the ground up. When I’m not coding, I’m exploring game design ideas, optimizing systems for performance, and pushing the boundaries of what a solo developer can achieve.",
    "Why": [
      "Proven track record of delivering high-quality, high-performance projects.",
      "Versatile full-stack developer skilled in Node.js, TypeScript, Phaser 3, Socket.io, and MariaDB.",
      "Experienced in real-time multiplayer systems and cross-platform deployment.",
      "Strong problem-solving skills, capable of working independently and troubleshooting complex issues."
    ],
    "Why2": [
      "Innovative system and game design, creating features that enhance user experience and engagement.",
      "Strategic thinker with a focus on scalable, long-term project growth.",
      "Passionate about sharing knowledge, mentoring, and improving team workflows.",
      "Excellent communication skills and commitment to delivering results that exceed expectations."
    ]
  },
  "Projects": [
    {
      "title": "Project Title",
      "largeImage": "imgs/project1.jpg",
      "smallImage": "imgs/project1.jpg"
    },
    {
      "title": "Project Title",
      "largeImage": "imgs/project2.jpg",
      "smallImage": "imgs/project2.jpg"
    },
    {
      "title": "Project Title",
      "largeImage": "imgs/project3.jpg",
      "smallImage": "imgs/project3.jpg"
    },
    {
      "title": "Project Title",
      "largeImage": "imgs/project4.jpg",
      "smallImage": "imgs/project4.jpg"
    },
    {
      "title": "Project Title",
      "largeImage": "imgs/project5.jpg",
      "smallImage": "imgs/project5.jpg"
    },
    {
      "title": "Project Title",
      "largeImage": "imgs/project6.jpg",
      "smallImage": "imgs/project6.jpg"
    },
    {
      "title": "Project Title",
      "largeImage": "imgs/project7.jpg",
      "smallImage": "imgs/project7.jpg"
    },
    {
      "title": "Project Title",
      "largeImage": "imgs/project8.jpg",
      "smallImage": "imgs/project8.jpg"
    },
    {
      "title": "Project Title",
      "largeImage": "imgs/project9.jpg",
      "smallImage": "imgs/project9.jpg"
    }
  ],
  "Skills": [
    {
      "icon": "faHtml5",
      "name": "HTML5",
      "text": "The backbone of the web. I use HTML5 to structure content and create semantic, accessible markup.",
      "color": "orange"
    },
    {
      "icon": "faCss3",
      "name": "CSS3",
      "text": "Styling made powerful. I bring designs to life with responsive layouts, animations, and modern CSS techniques.",
      "color": "blue"
    },
    {
      "icon": "faJs",
      "name": "JavaScript/TypeScript",
      "text": "The language of interactivity. I use JS to build dynamic, responsive, and engaging web experiences.",
      "color": "yellow"
    },
    {
      "icon": "faReact",
      "name": "React",
      "text": "Component-driven UI. I leverage React for efficient, reusable, and state-driven front-end development.",
      "color": "blue"
    },
    {
      "icon": "faBootstrap",
      "name": "Bootstrap",
      "text": "Rapid responsive design. I use Bootstrap to quickly prototype and implement mobile-first, consistent layouts.",
      "color": "blue"
    },
    {
      "icon": "faNodeJs",
      "name": "Node.js",
      "text": "Server-side JavaScript. I build fast, scalable backend services and APIs using Node.js.",
      "color": "green"
    },
    {
      "icon": "faGit",
      "name": "Git",
      "text": "Version control mastery. I manage code changes, track history, and collaborate seamlessly using Git.",
      "color": "black"
    },
    {
      "icon": "faGithub",
      "name": "GitHub",
      "text": "Collaborative development. I host, review, and manage projects using GitHub’s ecosystem.",
      "color": "black"
    },
    {
      "icon": "faWind",
      "name": "Windsurf",
      "text": "My go-to AI-powered editor built on VS Code, enhancing productivity with smart autocomplete, chat, and seamless integration.",
      "color": "black"
    }
  ],
  "Contact": {
    "address": " P.O. Box 1693, Kingston, Washington 98346",
    "phone": "+1 360 524 2745",
    "email": "jebarpg@gmail.com",
    "linkedin": "https://linkedin.com/in/jebradwell",
    "github": "https://github.com/jebarpg",
    "medium": "https://medium.com/@jebarpg"
  }
}